In [1]:
import pandas as pd 
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv('C:/Users/joao_/Desktop/4 ANO JOAO/SINO/VS CODE PROJETO/Datasets/bank-full-transformed.csv')

In [3]:
data.head()

,age,job,marital,education,default,balance,housing,loan,day,month,campaign,pdays,previous,y
0,50,management,married,tertiary,0,0,1,0,0,5,1,0,0,0
1,40,technician,single,secondary,0,0,1,0,0,5,1,0,0,0
2,30,entrepreneur,married,secondary,0,0,1,1,0,5,1,0,0,0
3,40,blue-collar,married,other,0,0,1,0,0,5,1,0,0,0
4,30,other,single,other,0,0,0,0,0,5,1,0,0,0

In [4]:
data.loc[(data['pdays'] == 1)]

,age,job,marital,education,default,balance,housing,loan,day,month,campaign,pdays,previous,y
24041,30,admin.,married,tertiary,0,0,0,0,1,10,1,1,2,0
24043,40,admin.,single,secondary,0,-1,1,1,1,10,1,1,1,1
24045,30,services,married,secondary,0,1,1,0,1,10,1,1,2,1
24053,30,management,married,tertiary,0,0,1,0,1,10,1,1,2,0
24058,30,management,married,tertiary,0,0,1,0,1,10,1,1,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45178,30,blue-collar,single,secondary,0,0,1,0,1,11,2,1,2,0
45180,50,management,married,tertiary,0,0,0,0,1,11,1,1,2,1
45183,60,retired,married,secondary,0,1,0,0,1,11,1,1,2,1
45187,60,retired,married,secondary,0,2,0,0,1,11,2,1,2,1
45189,30,entrepreneur,married,secondary,0,1,0,0,1,11,2,1,2,0

In [5]:
data.loc[(data['day'] == 1) & (data['y'] == 1)]

,age,job,marital,education,default,balance,housing,loan,day,month,campaign,pdays,previous,y
3676,30,services,single,other,0,0,1,0,1,5,1,0,0,1
3680,30,technician,married,tertiary,0,0,1,1,1,5,1,0,0,1
3700,30,management,married,tertiary,0,0,1,0,1,5,1,0,0,1
3701,40,admin.,divorced,secondary,0,0,1,0,1,5,1,0,0,1
3707,30,self-employed,single,tertiary,0,0,1,0,1,5,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45183,60,retired,married,secondary,0,1,0,0,1,11,1,1,2,1
45184,20,technician,single,secondary,0,0,0,1,1,11,2,0,0,1
45185,50,technician,married,tertiary,0,0,0,0,1,11,2,0,0,1
45186,60,retired,divorced,primary,0,0,0,0,1,11,2,0,0,1
45187,60,retired,married,secondary,0,2,0,0,1,11,2,1,2,1

In [6]:
data.loc[(data['month'] == 3) & (data['y'] == 1)]

,age,job,marital,education,default,balance,housing,loan,day,month,campaign,pdays,previous,y
31182,40,services,married,secondary,0,0,1,0,0,3,2,0,0,1
31187,30,services,married,secondary,0,0,1,0,0,3,2,0,0,1
31189,50,technician,married,secondary,0,0,1,1,0,3,1,0,0,1
31191,40,blue-collar,married,primary,0,1,0,0,0,3,1,0,0,1
31195,30,technician,married,tertiary,0,0,0,0,0,3,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
43362,30,admin.,single,tertiary,0,2,0,0,1,3,2,0,0,1
43363,40,admin.,divorced,tertiary,0,0,1,0,1,3,2,0,0,1
43364,60,retired,divorced,primary,0,0,0,0,1,3,1,1,2,1
43365,40,management,married,tertiary,0,0,0,0,1,3,1,1,1,1
43366,20,student,single,secondary,0,2,0,0,1,3,1,1,1,1

In [7]:
data.loc[(data['month'] == 3)]

,age,job,marital,education,default,balance,housing,loan,day,month,campaign,pdays,previous,y
31182,40,services,married,secondary,0,0,1,0,0,3,2,0,0,1
31183,30,technician,married,secondary,0,0,1,1,0,3,2,0,0,0
31184,30,management,married,tertiary,0,1,1,0,0,3,2,0,0,0
31185,30,management,married,tertiary,0,0,1,0,0,3,2,1,2,0
31186,20,technician,single,tertiary,0,0,0,0,0,3,2,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
43364,60,retired,divorced,primary,0,0,0,0,1,3,1,1,2,1
43365,40,management,married,tertiary,0,0,0,0,1,3,1,1,1,1
43366,20,student,single,secondary,0,2,0,0,1,3,1,1,1,1
43367,20,self-employed,single,tertiary,0,0,0,0,1,3,1,1,1,0
43368,30,blue-collar,married,primary,0,0,1,0,1,3,1,0,0,0

In [8]:
data.loc[(data['pdays'] == 2)]

Empty DataFrame
Columns: [age, job, marital, education, default, balance, housing, loan, day, month, campaign, pdays, previous, y]
Index: []

In [9]:
data.loc[(data['day'] == 0) & (data['y'] == 1)]

,age,job,marital,education,default,balance,housing,loan,day,month,campaign,pdays,previous,y
83,50,admin.,married,secondary,0,0,1,0,0,5,1,0,0,1
86,50,admin.,married,secondary,0,0,0,0,0,5,1,0,0,1
87,40,technician,married,secondary,0,0,1,0,0,5,1,0,0,1
129,50,services,married,secondary,0,0,1,0,0,5,1,0,0,1
168,50,admin.,married,tertiary,0,0,0,0,0,5,2,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45154,30,entrepreneur,single,secondary,0,1,0,0,0,11,2,1,2,1
45155,50,admin.,married,secondary,0,0,1,0,0,11,1,0,0,1
45156,30,admin.,divorced,secondary,0,0,1,0,0,11,1,1,1,1
45157,30,blue-collar,married,secondary,0,0,1,0,0,11,1,1,2,1
45161,30,technician,married,secondary,0,0,0,0,0,11,2,1,2,1

In [10]:
data.loc[(data['month'] == 2) & (data['y']== 1)]

,age,job,marital,education,default,balance,housing,loan,day,month,campaign,pdays,previous,y
28905,60,technician,married,secondary,0,0,0,0,0,2,1,0,0,1
28912,40,technician,single,tertiary,0,0,1,0,0,2,1,1,2,1
28916,40,unemployed,married,secondary,0,0,0,0,0,2,1,0,0,1
28922,50,technician,married,secondary,1,-1,0,0,0,2,1,0,0,1
28946,60,retired,married,secondary,0,0,0,0,0,2,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
43137,60,retired,divorced,secondary,0,0,0,0,1,2,1,1,1,1
43138,30,management,married,tertiary,0,0,0,0,1,2,2,1,2,1
43139,50,technician,married,secondary,0,0,0,1,1,2,1,1,2,1
43143,30,management,single,tertiary,0,2,0,0,1,2,1,1,2,1
43146,60,retired,married,other,0,0,0,0,1,2,2,1,2,1

In [11]:
data.loc[(data['month'] >6) & (data['y']== 1)]

,age,job,marital,education,default,balance,housing,loan,day,month,campaign,pdays,previous,y
12445,40,blue-collar,single,secondary,0,0,1,0,0,7,2,0,0,1
12489,30,technician,single,tertiary,0,0,0,0,0,7,2,0,0,1
12493,20,technician,single,secondary,0,0,0,0,0,7,2,0,0,1
12532,20,services,single,secondary,0,0,0,1,0,7,2,0,0,1
12562,30,services,married,secondary,0,0,0,1,0,7,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45183,60,retired,married,secondary,0,1,0,0,1,11,1,1,2,1
45184,20,technician,single,secondary,0,0,0,1,1,11,2,0,0,1
45185,50,technician,married,tertiary,0,0,0,0,1,11,2,0,0,1
45186,60,retired,divorced,primary,0,0,0,0,1,11,2,0,0,1
45187,60,retired,married,secondary,0,2,0,0,1,11,2,1,2,1

In [12]:
data.loc[(data['default'] == 1) & (data['y']== 1)]

,age,job,marital,education,default,balance,housing,loan,day,month,campaign,pdays,previous,y
1767,30,blue-collar,married,secondary,1,-1,1,0,0,5,1,0,0,1
2387,20,services,single,secondary,1,-1,1,0,0,5,1,0,0,1
4896,30,blue-collar,single,secondary,1,0,1,0,1,5,1,0,0,1
7635,40,technician,married,secondary,1,0,0,0,1,5,1,0,0,1
8216,40,technician,single,secondary,1,-1,1,0,0,6,2,0,0,1
8343,40,management,divorced,tertiary,1,-1,1,0,0,6,2,0,0,1
8440,40,self-employed,married,secondary,1,-1,1,1,0,6,2,0,0,1
8568,20,blue-collar,single,secondary,1,-1,1,0,0,6,2,0,0,1
8815,20,management,single,tertiary,1,-1,1,0,0,6,2,0,0,1
9142,50,housemaid,divorced,primary,1,0,0,0,0,6,1,0,0,1
9440,20,technician,single,secondary,1,-1,1,0,0,6,2,0,0,1
10452,20,blue-collar,single,secondary,1,-1,1,0,0,6,2,0,0,1
11524,40,entrepreneur,married,tertiary,1,0,0,0,1,6,2,0,0,1
12247,20,blue-collar,single,secondary,1,-1,0,0,1,6,2,0,0,1
12860,40,blue-collar,single,secondary,1,0,1,1,0,7,1,0,0,1
13064,50,entrepreneur,married,tertiary,1,-1,0,0,0,7,1,0,0,1
13080,20,technician,single,secondary,1,0,0,1,0,7,1,0,0,1
13198,20,blue-collar,single,secondary,1,0,0,1,0,7,2,0,0,1
13511,20,admin.,divorced,tertiary,1,0,0,1,0,7,2,0,0,1
13542,30,management,married,tertiary,1,0,1,1,0,7,2,0,0,1
14693,30,services,divorced,secondary,1,0,0,1,0,7,2,0,0,1
15347,30,technician,married,secondary,1,-1,1,0,1,7,2,0,0,1
15353,30,services,single,secondary,1,-1,1,0,1,7,1,0,0,1
16666,40,blue-collar,married,secondary,1,0,0,1,1,7,1,0,0,1
17994,40,unemployed,single,primary,1,-1,0,1,1,7,2,0,0,1
17998,40,entrepreneur,divorced,other,1,-1,1,0,1,7,2,0,0,1
18035,40,services,married,other,1,-1,0,1,1,7,2,0,0,1
18403,40,entrepreneur,married,tertiary,1,-1,0,0,1,7,2,0,0,1
19244,30,management,divorced,tertiary,1,0,0,0,0,8,2,0,0,1
20583,30,technician,single,secondary,1,0,0,0,0,8,2,0,0,1
20728,30,entrepreneur,single,tertiary,1,-1,1,1,0,8,2,0,0,1
22859,40,blue-collar,married,other,1,0,0,0,1,8,2,0,0,1
24546,40,self-employed,married,secondary,1,0,1,0,1,11,1,0,0,1
26174,40,blue-collar,single,secondary,1,-1,0,1,1,11,1,0,0,1
27041,40,management,single,tertiary,1,0,1,0,1,11,1,0,0,1
27744,50,technician,divorced,secondary,1,0,0,0,1,1,1,0,0,1
28201,50,blue-collar,married,primary,1,-1,0,0,1,1,1,0,0,1
28642,20,management,single,primary,1,0,0,0,1,1,2,0,0,1
28922,50,technician,married,secondary,1,-1,0,0,0,2,1,0,0,1
32180,30,blue-collar,married,secondary,1,-1,1,0,1,4,1,1,1,1
32798,30,technician,single,secondary,1,-1,1,0,1,4,1,0,0,1
32805,30,blue-collar,divorced,other,1,-1,1,1,1,4,2,1,2,1
32846,30,management,married,secondary,1,0,1,0,1,4,1,1,1,1
33271,40,blue-collar,married,secondary,1,0,1,0,1,4,1,0,0,1
33316,40,blue-collar,married,primary,1,-1,1,1,1,4,1,0,0,1
34749,30,technician,divorced,tertiary,1,0,0,0,0,5,1,0,0,1
35540,40,admin.,married,secondary,1,-1,1,1,0,5,2,1,1,1
37689,20,admin.,single,secondary,1,-1,1,0,0,5,1,0,0,1
38413,30,entrepreneur,married,tertiary,1,-1,1,0,0,5,2,0,0,1
40927,40,unemployed,divorced,primary,1,0,0,0,0,8,2,0,0,1
41541,60,retired,divorced,tertiary,1,0,1,0,0,9,2,0,0,1
44078,20,management,single,tertiary,1,0,1,0,0,7,1,1,1,1